tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    ground
    {
        type            calculated;
        value           $internalField;
    }

    side
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            calculated;
        value           $internalField;
    }

}


// ************************************************************************* //
